# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные. 

a = 2
message = "hello"
b = 2.0
print(f'Переменная a - {type(a)}')
print(f'Переменная message - {type(message)}')
print(f'Переменная b - {type(b)}')